Revit 2027 API
RebarHandlesData.SetEndHandle Method
 Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEndHandle(
	int endHandleTag
)
Public Sub SetEndHandle (
	endHandleTag As Integer
)
public:
void SetEndHandle(
	int endHandleTag
)
member SetEndHandle :
        endHandleTag : int -> unit
Parameters
endHandleTag Int32
 The tag of the end handle.
See Also
Reference
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace